Repository: inrae/ALAMODE-cuspy
Catalog: sphinx-doc/tm/cuspy-level1.tmx
Source language: en_gb
Languages: fr_fr

source: These tests consist in the application of different :mod:`cuspy` functions to the OKP water temperature model with 8 adjustable parameters.
fr_fr: Ces tests consistent en l'application de différentes fonctions :mod:`cuspy` au modèle OKP de température de l'eau avec 8 paramètres ajustables.

source: They are based in obtaining a large number of simulations by varying the value of the parameters of the model.
fr_fr: Elles sont basées en l'obtention d'un grand nombre de simulations par le biais de la variation des valeurs des paramètres du modèle.

source: They are conditional to the ranges of parameter values and input data used: model or data deficiencies not yet detected might be discovered in the future, when the model has been tested in other situations or with more data.
fr_fr: Elles sont conditionnelles aux rangs des valeurs des paramètres et des données d'entrée utilisés : imperfections du modèle ou des données pourrait être détectées dans un temps futur, quand le modèle a été testé en d'autres situations ou avec plus de données.

source: They contain the translatable text broken down into segments.
fr_fr: Ils contiennent le texte traduisible coupé en segments.

source: They have a very high computational cost (of the order of thousands of Monte Carlo runs).
fr_fr: Ils ont un coût computationnel très élevé (de l'ordre de milliers d'exécutions de Monte Carlo).

source: They have the same format as the model output file, but include only the available observations.
fr_fr: Ils doivent avoir le même format que le fichier de sortie du modèle, mais ils incluent seulement les observations disponibles.

source: They implement several linear and nonlinear uncertainty analysis, calibration methods and global sensitivity analyses.
fr_fr: Ils implémentent plusieurs analyses d'incertitudes linéaires et non linéaires, méthodes de calibration et analyses de sensitivité globale.

source: They receive a null weight and their value is not used in calculations.
fr_fr: Elles prennent un poids nul et leur valeur n'est pas utilisée dans les calculs.

source: They require a large number of simulations.
fr_fr: Elles requièrent un grand nombre de simulations.

source: They use linear algebra to estimate uncertainty and require few simulations.
fr_fr: Elles utilisent l'algèbre linéaire pour estimer l'incertitude et ont besoin de peu de simulations.

source: This analysis is related with the analysis of identifiability and data worth.
fr_fr: Cette analyse est liée à l'analyse d'identifiabilité et la valeur des données.

source: This command creates the :mod:`cuspy` repertory in the folder :file:`pathtoprojectsfolder`.
fr_fr: Cette commande crée le répertoire :mod:`okplm` dans le dossier :file:`pathtoprojectsfolder`.

source: This definition can be translated into practice in different ways:
fr_fr: Cette définition peut être transposée dans la pratique de plusieurs façons :

source: This figure shows the percentage reduction in uncertainty that we would obtain in the estimation of the value of the parameters by acquiring a measurement on the given days.
fr_fr: Cette figure montre le pourcentage de réduction de l'incertitude de l'estimation des paramètres qu'on obtiendrait par l'acquisition d'une mesure dans les jours donnés.

source: This file can take several forms:
fr_fr: Ce fichier peut prendre plusieurs formes :

source: This file must be provided by the users, based on their previous knowledge of the optimum parameter values and acceptable ranges of variation.
fr_fr: Ce fichier doit être donné par l'utilisateur, sur la base de ses connaissances antérieures des valeurs des paramètres optimales et des rangs de variation acceptables.

source: This function calls the PEST++ executable `pestpp-glm`.
fr_fr: Cette fonction appelle l'exécutable de PEST++ `pestpp-glm`.

source: This function calls the PEST++ executable `pestpp-ies`.
fr_fr: Cette fonction appelle l'exécutable de PEST++ `pestpp-ies`.

source: This function calls the PEST++ executable `pestpp-sen`.
fr_fr: Cette fonction appelle l'exécutable de PEST++ `pestpp-sen`.

source: This function calls the PEST++ executable `pestpp-swp`.
fr_fr: Cette fonction appelle l'exécutable de PEST++ `pestpp-swp`.

source: This function is used to read data (observations or predictions) from a file.
fr_fr: Cette fonction sert à lire des données (observations ou prédictions) depuis un fichier.

source: This function is used to write a PEST(++) instruction file, a text file used to specify how PEST should read a model's output file.
fr_fr: Cette fonction sert à écrire un fichier d'instructions de PEST(++), un fichier texte utilisé pour spécifier comment PEST doit lire le fichier de sortie d'un modèle.

source: This function launches the requested PEST++ executable, either making calculations on line or in parallel.
fr_fr: Cette fonction lance l'exécutable PEST++ sollicité, soit faisant les calcules en séquentiellement ou en parallèle.

source: This function writes a PEST template parameter file, a text file used to specify the format of the parameter file.
fr_fr: Cette fonction écrit un fichier de paramètres modèle de PEST, un fichier texte utilisé pour spécifier le format du fichier de paramètres.

source: This function writes a Python dictionary to a file.
fr_fr: Cette fonction écrit un dictionnaire Python à un fichier.

source: This includes stating the desired quality of the simulations, i.e., what constitutes good performance in your particular modelling setup.
fr_fr: Ça inclue décider quelle est la qualité désirée des simulations, soit, qu'est-ce qui constitue une bonne performance dans le type particulier de scénario de modélisation.

source: This includes the control file, instructions file and template parameter file.
fr_fr: Ces fichiers incluent le fichier de contrôle, le fichier d'instructions et le fichier de paramètres modèle.

source: This is also related to the concept of data worth.
fr_fr: Ceci est lié aussi au concept de valeur des données.

source: This is based on the fact that the behaviour of a nonlinear (continuously derivable) function in an interval around a certain point (the parameter value) can be assumed to be linear if the interval is small enough.
fr_fr: Ceci est basé sur le fait que le comportement d'une fonction (continuellement dérivable) non linéaire dans un intervalle autour d'un certain point (la valeur du paramètre) peut être présumé linéaire si l'intervalle est assez petit.

source: This is known as equifinality (Beven & Freer, 2001).
fr_fr: Ceci est connu comme equifinalité (Beven & Freer, 2001).

source: This is quite logical since :math:`\alpha` determines the higher asymptote of the logistic curve and :math:`\mu` determines the lower asymptote.
fr_fr: Ceci est assez logique car :math:`\alpha` détermine l'asymptote supérieure de la courbe logistique et :math:`\mu` en détermine l'asymptote inférieure.

source: This is related to the difficulty in obtaining a precise value for the parameter :math:`\alpha` and the fact that the warming makes summer temperatures leave the range of values for which there is information.
fr_fr: Ceci a relation avec la difficulté à obtenir une valeur précise du paramètre :math:`\alpha` et le fait que le réchauffement fait que les températures d'été sortent du rang de valeurs pour lesquels il y a de l'information.

source: This is the rational for the modification proposed by Koch & Grünewald (2010) to Eq.
fr_fr: Ceci est la justification de la modification proposée par Koch & Grünewald (2010) de l'Éq.

source: This is the usage in local sensitivity analyses (sensitivity is evaluated at a given point), and sensitivity indices are often estimated by varying one parameter at a time.
fr_fr: Ceci est l'usage qu'on trouve dans les analyses de sensitivité locaux (la sensitivité est évaluée sur un point donné), et les indices de sensitivité sont souvent estimés en faisant varier un paramètre à chaque fois.

source: This is useful when some measurements are more uncertain than others.
fr_fr: Ce-ci est d'utilité quand quelques mesures sont plus incertaines que d'autres.

source: This means that multiple combinations of the values of these parameters results in simulations of similar quality, thus increasing the uncertainty of parameter values.
fr_fr: Ceci signifie que plusieurs combinaisons des valeurs des paramètres produisent des simulations de qualité similaire, ce qui fait augmenter l'incertitude des valeurs des paramètres.

source: This means that the model will perform best when the behaviour of the system is similar to the behaviour reflected in the calibration data.
fr_fr: En conséquence, le modèle aura une meilleur performance quand le comportement du système est similaire au comportement imbu dans les données de calibration.

source: This means that the solution obtained for the parameters :math:`\alpha`, :math:`\beta` and :math:`\mu` is not unique, but one of several possibilities with a similar error level.
fr_fr: Ceci signifie que la solution obtenue pour les paramètres :math:`\alpha`, :math:`\beta` et :math:`\mu` n'est pas unique, mais une de plusieurs possibilités avec un niveau de l'erreur similaire.

source: This method can reveal the existence of nonlinearity and interactions between parameters.
fr_fr: Cette méthode peut révéler l'existence de non-linéarité et d'interactions entre paramètres.

source: This module contains the following function:
fr_fr: Ce module contient les fonctions suivantes :

source: This module contains the following functions:
fr_fr: Ce module contient les fonctions suivantes :

source: This package allows you to carry several types of analysis:
fr_fr: Ce paquet vous permet de réaliser plusieurs types d'analyses :

source: This points to a critical issue: the difficulty in predicting water temperature is greatest when there is a higher risk of high temperatures.
fr_fr: Cette situation remarque un problème critique : la difficulté de prédire la température de l'eau quand il y a les plus grand risque d'avoir des hautes températures.

source: This section describes the process to translate the `User and Developer Guide` by using pot and po files and the package :mod:`sphinx-intl`.
fr_fr: Cette section décrit le procès pour traduire le `Guide d'Utilisation et Développement`, qui utilise des fichiers pot et po et le package :mod:`sphinx-intl`.

source: This type of unidentifiability can be analysed irrespective of the availability of data.
fr_fr: Ce type de manque d'identifiabilité peut être analysé indépendamment de la disponibilité des données.

source: Thus calculation time is usually much greater than shown here.
fr_fr: En conséquence le temps de calcul est beaucoup plus grand que celui montré ici.

source: Thus the concept of data worth is especially important for the design of measurement networks and data collection campaigns.
fr_fr: Ainsi le concept de la valeur des données est spécialement important pour la planification de réseaux de mesure et de campagnes de collection de données.

source: Thus this method provides a global optimum.
fr_fr: Ainsi cette méthode proportionne un optimum global.

source: Thus to translate the text you need to edit the po files and type de translated text beside msgstr:
fr_fr: Ainsi pour traduire le texte vous devez éditer les fichiers po et taper le texte traduit à côté msgstr :

source: Thus, posterior predictive error is expected to be greater than posterior uncertainty.
fr_fr: Ainsi, on attend que l'erreur prédictive a posteriori soit plus grand que l'incertitude a posteriori.

source: Thus, the analysis of identifiability is related to the design of experiments and monitoring programs, so that the collected data ensures optimal identifiability.
fr_fr: Ainsi, l'analyse d'identifiabilité a relation avec le plan expérimental et les programmes de surveillance, de façon que le mesures enregistrées assurent une identifiabilité optimale.

source: Thus, the estimated values of the parameters based on them are imprecise.
fr_fr: Ainsi, les valeurs estimées des paramètres basées sur ces données sont imprécises.

source: Thus, the focus of uncertainty analysis is on determining the limits of our knowledge (and lack of knowledge) about the system and its response.
fr_fr: Ainsi, le point central d'intérêt de l'analyse d'incertitudes est la détermination des limites de nos connaissances (et de notre manque de connaissance) sur le système et ses réponses.

source: Thus, the original PEST control file `pst_file0` should be in the same folder as the files created during the calibration process.
fr_fr: Ainsi, le fichier de contrôle PEST originel `pst_file0` devrait être dans le même dossier que les fichiers créés pendant le procès de calibration.

source: Thus, the variation in individual parameters explains 70% of the output variance and the model may be considered to have a largely linear behaviour, notwithstanding the rather large parameter space explored here.
fr_fr: Ainsi, la variation des paramètres individuels explique un 70 % de la variance des sorties et on peut considérer que le modèle a un comportement largement linéaire, au malgré de l'espace des paramètres assez large qu'on a exploré ici.

source: Thus, to choose between a linear or nonlinear method it is necessary to take into account the model run time and computational cost of the method and the available data.
fr_fr: Ainsi, pour choisir entre une méthode linéaire ou non-linéaire il faut prendre en considération le temps de calcul, le coût computationnel de la méthode et les données disponibles.

source: Thus, validation and verification are only conditional (Boschetti et al.
fr_fr: Ainsi, la validation et vérification sont seulement conditionnelles (Boschetti et al.

source: Thus, we repeat the calibration with the GLM algorithm, but now without fixing the parameters :math:`\gamma` and :math:`\mu`.
fr_fr: Ainsi, nous répétons la calibration avec l'algorithme GLM, mais maintenant nous ne fixons plus les paramètres :math:`\gamma` et :math:`\mu`.

source: Thus, we will use 2 singular values in this case.
fr_fr: Ainsi, nous utiliserons 2 valeurs singulières dans ce cas.

source: To analyse predictive error with an error variance analysis you need to set ``analysis='err_var'``.
fr_fr: Pour analyser l'erreur prédictive avec un analyse de la variance de l'erreur vous devez le configurer avec ``analysis='err_var'``.

source: To answer this question we may use different models or model structures.
fr_fr: Pour répondre cette question on peut utiliser différents modèles ou structures du modèle.

source: To apply the IES method, you need to use the function :func:`ies`.
fr_fr: Pour appliquer la méthode, vous devez utiliser la fonction :func:`ies`.

source: To apply the changes to the po files, do
fr_fr: Pour appliquer les changements aux fichiers po, faites

source: To calibrate a model you can use the function :func:`calibration`.
fr_fr: Pour calibrer un modèle vous pouvez utiliser la fonction :func:`calibration`.

source: To carry Monte Carlo simulations with the :mod:`cuspy` package you can use the function :func:`monte_carlo`.
fr_fr: Pour réaliser des simulations de Monte Carlo avec le paquet :mod:`cuspy` vous pouvez utiliser la fonction :func:`monte_carlo`.

source: To carry a Schur's complement analysis, you need to set ``analysis='schur'``.
fr_fr: Pour réaliser un analyse du complément de Schur, vous devez le choisir avec ``analysis='schur'``.

source: To clone the ``pestpp`` source, do:
fr_fr: Pour cloner le code source de ``pestpp``, faites :

source: To compile pdf documents (only in Linux), you will also need to have installed latex and the Python package :mod:`latexmk`.
fr_fr: Pour compiler documents pdf (seulement sous Linux), il vous faudra installer aussi latex et le paquet Python :mod:`latexmk`.

source: To compile the PEST++ executables, go to the :file:`pestpp/src` folder and do:
fr_fr: Pour compiler les exécutables de PEST++, allez au dossier :file:`pestpp/src` et faites :

source: To compile the pdf documentation, type the following commands:
fr_fr: Pour compiler la documentation en pdf, tapez les commandes suivantes :

source: To compile the user manual in English as html files go to the folder :file:`pathtorepertorycuspy/sphinx-doc` and type:
fr_fr: Pour compiler le manuel d'utilisation en anglais en html allez au dossier :file:`pathtorepertorycuspy/sphinx-doc` et tapez :

source: To compile the user manual in French as html files go to the folder :file:`pathtorepertorycuspy/sphinx-doc` and type:
fr_fr: Pour compiler le manuel d'utilisation en français en html allez au dossier :file:`pathtorepertorycuspy/sphinx-doc` et tapez :

source: To create multilingual documentation, you will need the package :mod:`sphinx-intl`.
fr_fr: Pour créer documentation multilingue, vous avez besoin du paquet :mod:`sphinx-intl`.

source: To demonstrate the concepts and techniques implemented in this package we will use the study case of the simulation of surface water temperature using one simple model depending on air temperature.
fr_fr: Pour démontrer les concepts et techniques implémentées dans ce paquet nous présentons le cas d'étude de la simulation de la température de la surface de l'eau en utilisant un modèle simple qui dépend de la température de l'air.

source: To do this we will use the same air temperatures for 2015 but increased by 1.5 ºC to simulate water temperature using eq.
fr_fr: Pour faire ça, nous utiliserons les mêmes températures de l'air que pour 2015 mais incrémentées de 1.5ºC pour simuler la température de l'eau avec l'éq.

source: To extract the document's translatable messages into pot files, change to the :file:`sphinx-doc` directory in the terminal and do:
fr_fr: Pour extraire les messages traduisibles du document vers des fichiers pot, changez au dossier :file:`sphinx-doc` dans le terminal et faites :

source: To improve the situation it may help analysing the influence of measurement error on parameter estimation.
fr_fr: Pour améliorer la situation il peut être utile d'analyser l'influence de l'erreur de mesure sur l'estimation des paramètres.

source: To install :mod:`cuspy`, go to the repertory created during the cloning of the package :mod:`cuspy` (e.g., :file:`pathtorepertorycuspy`) and install it using ``pip``:
fr_fr: Pour installer :mod:`cuspy`, allez au répertoire créé pendant le clonage de :mod:`cuspy` (p. ex., :file:`pathtorepertorycuspy`) et installe-le avec ``pip``.

source: To install :mod:`sphinx` just make:
fr_fr: Pour installer :mod:`sphinx` simplement faites

source: To install latex, type:
fr_fr: Pour installer latex, tapez :

source: To install the development branch of the project, after cloning the :mod:`cuspy` package, change to the ``dev`` branch:
fr_fr: Pour installer la branche de développement du projet, changez à la branche ``dev`` après avoir cloné le paquet :mod:`cuspy` package :

source: To install them you can use:
fr_fr: Pour les installer vous pouvez utiliser :

source: To obtain prior and posterior uncertainties for the predictions of interest and the reduction in uncertainty due to calibration ('schur'), type:
fr_fr: Pour obtenir les incertitudes a priori et a posteriori pour les prédictions d'intérêt et la réduction de l'incertitude due à la calibration ('schur'), tapez :

source: To obtain the calibrated parameter values, type:
fr_fr: Pour obtenir les valeurs des paramètres calibrées, tapez :

source: To obtain the contribution of each parameter to prediction uncertainty, type:
fr_fr: Pour obtenir la contribution de chaque paramètre à l'incertitude de prédiction, tapez :

source: To obtain the prior uncertainty of predictions, type:
fr_fr: Pour obtenir l'incertitude a priori des prédictions, tapez :

source: To obtain the simulated values and residuals, type:
fr_fr: Pour obtenir les valeurs simulées et les résidus, tapez :

source: To reduce simulation uncertainty, we need to calibrate the model choosing appropriate values for the model parameters.
fr_fr: Pour réduire l'incertitude de la simulation, nous avons besoin de calibrer le modèle et choisir de valeurs appropriées pour les valeurs des paramètres.

source: To reduce this uncertainty, we may fix the value of the parameters :math:`\gamma` and :math:`\mu` to their average values, and calibrate the value of the parameters :math:`\alpha` and :math:`\beta`.
fr_fr: Pour réduire cette incertitude, on peut fixer la valeur des paramètres :math:`\gamma` et :math:`\mu` sur les valeurs moyennes, et calibrer la valeur des paramètres :math:`\alpha` et :math:`\beta`.

source: To run a python script from the command line, type:
fr_fr: Pour exécuter un script python script en ligne de commande, tapez :

source: To use :mod:`cuspy` as a Python module you can simply import it and use the functions within::
fr_fr: Pour utiliser :mod:`cuspy` comme un module Python vous pouvez simplement l'importer et utiliser les fonctions qu'il contient :

source: Transformation applied to all the parameters or list of transformations applied to each parameter.
fr_fr: Transformation appliquée à tous les paramètres ou liste de transformations appliquées pour chaque paramètre.

source: Translation
fr_fr: Traduction

source: Translation of the project's documentation
fr_fr: Traduction de la documentation du projet

source: Two implemented methods:
fr_fr: Deux méthodes implémentées :

source: Two methods can be used to carry a global sensitivity analysis: Morris's method and Sobol's method.
fr_fr: Deux méthodes peuvent être utilisées pour réaliser un analyse de sensitivité globale : méthode de Morris et méthode de Sobol.

source: Type of parameter change limit (value to apply to all the parameters or list of values).
fr_fr: Type de limite de changement du paramètre (valeur à appliquer à tous les paramètres ou liste de valeurs).

source: Type of predictive uncertainty analysis.
fr_fr: Type d'analyse d'incertitudes prédictives.

source: Uncertainty analysis
fr_fr: Analyse d'incertitudes

source: Uncertainty analysis and sensitivity analysis are related concepts:
fr_fr: L'analyse de sensitivité et l'analyse d'incertitudes sont des concepts relationnés.

source: Uncertainty analysis consists in the quantification of the uncertainties in model inputs and propagating them to obtain the uncertainty of model forecasts.
fr_fr: L'analyse d'incertitudes consiste en la quantification des incertitudes des entrées du modèle et en leur propagation pour obtenir l'incertitude des prédictions du modèle.

source: Uncertainty is greater for periods of high and, especially, for low temperatures.
fr_fr: L'incertitude est plus grande pour les périodes avec des températures élevées et, spécialement, basses.

source: Unidentifiability due to model and observation errors.
fr_fr: Manque d'identifiabilité due aux erreurs du modèle et des observations.

source: Unidentifiability due to the forcing dataset.
fr_fr: Manque d'identifiabilité dû aux données de forçage.

source: Update of the translated documentation
fr_fr: Mise à jour de la documentation traduite

source: Usage
fr_fr: Utilisation

source: Use as many singular values as necessary to account for at least 90 % (or 99%) of total energy.
fr_fr: Utiliser autant de valeurs singulières comme il faut pour représenter au moins un 90 % (ou 99 %) de l'énergie totale.

source: Use of more advanced methods to solve modelling problems.
fr_fr: Utilisation de méthodes plus puisées pour résoudre problèmes de modélisation.

source: Use plots, graphs, animations and other visual methods to gain an overview of overall performance.
fr_fr: Il faut utiliser figures, graphiques, animations et d'autres méthodes visuelles pour acquérir une vision d'ensemble de la performance du modèle.

source: Useful functions.
fr_fr: Fonctions d'utilité.
